[
  {
    "id": 1,
    "name": "متحف المجوهرات الملكية",
    "nameEn": "Royal Jewelry Museum",
    "category": "Cultural",
    "location": "الإسكندرية",
    "locationEn": "Alexandria",
    "address": "قصر الأميرة فاطمة الزهراء، منطقة زيزينيا، الإسكندرية، مصر",
    "description": "تعال اكتشف كنوز الملوك والملكات اللي عمرها ما اتعرضت للناس قبل كده! متحف فريد يعرض مجوهرات ملكية نادرة في قصر أوروبي فاخر.",
    "longDescription": "متحف المجوهرات الملكية هو متحف فريد من نوعه يقع في قصر الأميرة فاطمة الزهراء بمنطقة زيزينيا بالإسكندرية. تم بناء القصر في أوائل القرن العشرين وكان ملكًا للعائلة الملكية المصرية. في عام 1996 تم تحويله إلى متحف يعرض المجوهرات الملكية التي كانت تخص ملوك وملكات مصر. يعكس القصر الفخامة والمعمار الأوروبي مع حدائق واسعة وتصميم داخلي رائع. يضم المتحف مقتنيات نادرة وفاخرة تشمل مجوهرات ذهبية وفضية، ساعات ملكية، تيجان وأكسسوارات تاريخية، مع عرض قصص كل قطعة وكيف استخدمت في المناسبات الملكية.",
    "images": [
      "main.jpg",
      "interior 1.jpg",
      "interior 2.jpg",
      "interior 3.jpg"
    ],
    "ticketPrice": "المصريين والعرب: 20 جنيه للكبار، 5 جنيه للطلاب | الأجانب: 220 جنيه للكبار، 110 جنيه للطلاب",
    "ticketPriceEn": "Egyptians & Arabs: 20 EGP adults, 5 EGP students | Foreigners: 220 EGP adults, 110 EGP students",
    "openingHours": "يوميًا من 9:00 صباحًا إلى 5:00 مساءً (آخر تذكرة: 4:00 مساءً)",
    "openingHoursEn": "Daily 9:00 AM - 5:00 PM (Last ticket: 4:00 PM)",
    "heritageStory": "تم بناء القصر في أوائل القرن العشرين وكان ملكًا للعائلة الملكية المصرية. يتميز بالتصميم الأوروبي الفخم مع أسقف مزخرفة بلوحات فنية رائعة، وأرضيات رخامية، وحدائق واسعة. يعرض المتحف الجواهر المصرية والعالمية مع قصة كل قطعة وكيف استخدمت في المناسبات الملكية.",
    "mapEmbed": "زيزينيا، الإسكندرية",
    "nearbyPlaces": ["طريق الكورنيش", "منطقة سيدي جابر", "طريق الجيش القديم"],
    "nearbyActivities": [
      "التنزه على كورنيش الإسكندرية",
      "زيارة قلعة قايتباي",
      "استكشاف منطقة سيدي جابر"
    ],
    "highlights": [
      "مجوهرات ذهبية وفضية نادرة",
      "ساعات ومجوهرات ملكية",
      "تيجان وأكسسوارات ملكية تاريخية",
      "تصميم أوروبي فخم",
      "أسقف مزخرفة وأرضيات رخامية",
      "حدائق واسعة"
    ],
    "importantNotes": [
      "الدخول مجاني لكبار السن (60 سنة فأكثر)",
      "الدخول مجاني لذوي الاحتياجات الخاصة",
      "الدخول مجاني للأطفال أقل من 6 سنوات",
      "ممنوع إدخال شنط كبيرة أو أطعمة/مشروبات",
      "ممنوع استخدام فلاش التصوير أو مؤشرات الليزر"
    ],
    "reviews": [
      {
        "name": "أحمد محمود",
        "rating": 5,
        "comment": "متحف رائع! المجوهرات الملكية مذهلة والقصر نفسه تحفة معمارية."
      },
      {
        "name": "سارة علي",
        "rating": 4.5,
        "comment": "تجربة فريدة لمحبي التاريخ والفن. الأسقف المزخرفة لا تُنسى!"
      }
    ]
  },
  {
    "id": 2,
    "name": "المتحف اليوناني الروماني",
    "nameEn": "Graeco-Roman Museum Alexandria",
    "category": "Historical",
    "location": "الإسكندرية",
    "locationEn": "Alexandria",
    "description": "رحلة عبر الزمن ... اكتشف أسرار الإسكندرية اليونانية والرومانية",
    "longDescription": "تأسس المتحف اليوناني الروماني سنة 1892، ويعتبر من أقدم المتاحف في مصر. كان الهدف منه جمع الآثار اليونانية والرومانية الموجودة في مصر، خاصة من مناطق الإسكندرية والبحر المتوسط. المتحف بعد التجديد أصبح متحف حديث وجذاب للزوار، ويضم عدد كبير من التماثيل، العملات، الفسيفساء، والمقتنيات الفنية.",
    "images": ["Graeco Roman Museum main.jpg"],
    "ticketPrice": "للمصريين والعرب: 40 جنيه للكبار - 20 جنيه للطلاب | للأجانب: 400 جنيه للكبار - 200 جنيه للطلاب",
    "openingHours": "من 9:00 صباحًا إلى 5:00 مساءً | الجمعة والسبت: حتى 8:00 مساءً (شباك التذاكر يغلق 7:00 مساءً) | رمضان: من 9:00 صباحًا إلى 4:00 مساءً",
    "heritageStory": "تأسس سنة 1892، ويعتبر من أقدم المتاحف في مصر. كان الهدف منه جمع الآثار اليونانية والرومانية الموجودة في مصر، خاصة من مناطق الإسكندرية والبحر المتوسط.",
    "address": "منطقة كرموز، الإسكندرية، مصر",
    "nearbyPlaces": ["محطة الرمل", "شارع سوريا", "كورنيش الإسكندرية"],
    "highlights": [
      "الآثار اليونانية والرومانية النادرة: تماثيل للإلهة أفروديت، أبولو، وغيرها، فسيفساء رومانية ملونة، نقوش قديمة على الحجر",
      "تصميم المتحف: قاعات واسعة ومنظمة بعناية، بعد الترميم أصبح المتحف جذاب للزوار المحليين والأجانب",
      "أهمية علمية وثقافية: مكان مثالي للطلاب والباحثين في علم الآثار الكلاسيكية، يعطي فكرة عن الحياة اليومية في الإسكندرية القديمة"
    ],
    "mapEmbed": "",
    "nearbyActivities": [
      "زيارة محطة الرمل",
      "التجول في شارع سوريا",
      "الاستمتاع بكورنيش الإسكندرية"
    ],
    "reviews": [
      {
        "name": "زائر",
        "rating": 5,
        "comment": "متحف رائع يحكي تاريخ الإسكندرية اليونانية والرومانية بشكل مميز!"
      }
    ]
  },
  {
    "id": 3,
    "name": "أهرامات الجيزة",
    "nameEn": "Pyramids of Giza",
    "category": "Historical",
    "location": "الجيزة",
    "locationEn": "Giza",
    "description": "أحد عجائب الدنيا السبع القديمة الباقية، دليل عبقرية الهندسة الفرعونية",
    "longDescription": "تقع أهرامات الجيزة في محافظة الجيزة غرب نهر النيل، على هضبة الجيزة. بُنِيت في عصر الدولة القديمة، الأسرة الرابعة حوالي سنة 2600 ق.م. تضم 3 أهرامات رئيسية: خوفو – خفرع – منقرع. كانت مقابر ملكية مصممة لحماية أجساد الملوك وضمان حياتهم في العالم الآخر. مبنية من ملايين أحجار الحجر الجيري، وهرم خوفو الأكبر ارتفاعه الأصلي 146م، أضخم بناء حجري في العالم. يضم الموقع تمثال أبو الهول المنحوت من صخرة واحدة أمام هرم خفرع.",
    "images": [
      "pyramids 1.jpg",
      "pyramids 2.jpg",
      "pyramids 3.jpg",
      "pyramids 4.jpg"
    ],
    "ticketPrice": "",
    "openingHours": "",
    "heritageStory": "بُنِيت في عصر الدولة القديمة، الأسرة الرابعة حوالي سنة 2600 ق.م. كانت مقابر ملكية مصممة لحماية أجساد الملوك وضمان حياتهم في العالم الآخر. تعتبر أحد عجائب الدنيا السبع القديمة الباقية ودليل عبقرية الهندسة الفرعونية.",
    "address": "هضبة الجيزة، محافظة الجيزة، غرب نهر النيل",
    "nearbyPlaces": ["القاهرة الكبرى", "نهر النيل"],
    "highlights": [
      "الهدف من بنائها: مقبرة ملكية محصّنة، رمز لقوة الملك وعبادته الإلهية، حفظ الكنوز والمتعلقات الجنائزية",
      "الوصف المعماري: مبنية من ملايين أحجار الحجر الجيري، هرم خوفو الأكبر ارتفاعه الأصلي 146م أضخم بناء حجري في العالم، ممرات وغرف داخلية معقدة مثل غرفة الملك والملكة، تمثال أبو الهول منحوت من صخرة واحدة",
      "الأهمية التاريخية: أحد عجائب الدنيا السبع القديمة الباقية، دليل عبقرية الهندسة الفرعونية، مصدر للمعرفة عن طقوس الدفن والعقيدة الدينية",
      "الأهمية السياحية: من أهم المزارات في العالم، موقع تصوير عالمي، منظر غروب الشمس عند الهضبة من أقوى التجارب السياحية"
    ],
    "mapEmbed": "",
    "nearbyActivities": [
      "تجربة ركوب الجمال والخيل حول الأهرامات",
      "مشاهدة غروب الشمس عند الهضبة",
      "التصوير في موقع عالمي مميز"
    ],
    "reviews": [
      {
        "name": "زائر",
        "rating": 5,
        "comment": "تجربة لا تُنسى! الأهرامات أضخم مما تتخيل ومنظر الغروب ساحر."
      }
    ]
  },
  {
    "id": 4,
    "name": "[PLACEHOLDER: Khan El Khalili Bazaar]",
    "category": "Cultural",
    "location": "Cairo",
    "description": "[PLACEHOLDER: Historic bazaar and souq dating back to the 14th century, famous for spices, jewelry, and crafts.]",
    "longDescription": "[PLACEHOLDER: Khan El-Khalili is a famous bazaar and souq in the historic center of Cairo, Egypt. Established as a center of trade during the Mamluk era, it remains one of Cairo's main attractions for tourists and Egyptians alike. The market is known for its narrow alleyways, ornate architecture, and traditional Egyptian goods.]",
    "images": ["khankhalili1.jpg", "khankhalili2.jpg", "khankhalili3.jpg"],
    "ticketPrice": "[PLACEHOLDER: Free Entry]",
    "openingHours": "[PLACEHOLDER: 9 AM - 11 PM]",
    "heritageStory": "[PLACEHOLDER: Founded in 1382 by Emir Djaharks el-Khalili, the bazaar has been the heart of Cairo's trading activity for over 600 years. It was originally built as a caravanserai, a roadside inn for travelers.]",
    "mapEmbed": "[PLACEHOLDER: Map embed code or image]",
    "nearbyActivities": [
      "[PLACEHOLDER: Visit Al-Azhar Mosque]",
      "[PLACEHOLDER: Egyptian Coffee at El Fishawy Cafe]",
      "[PLACEHOLDER: Explore Muizz Street]"
    ],
    "reviews": [
      {
        "name": "[PLACEHOLDER: User F]",
        "rating": 4,
        "comment": "[PLACEHOLDER: Great for souvenirs! Be ready to bargain.]"
      }
    ]
  },
  {
    "id": 5,
    "name": "[PLACEHOLDER: Ras Mohamed National Park]",
    "category": "Nature",
    "location": "Sharm El Sheikh",
    "description": "[PLACEHOLDER: A protected natural area known for stunning coral reefs and diverse marine life.]",
    "longDescription": "[PLACEHOLDER: Ras Mohamed National Park is an Egyptian national park located at the southern extreme of the Sinai Peninsula. The park is renowned for its spectacular coral reef systems and crystal-clear waters, making it one of the world's premier diving and snorkeling destinations. It is home to over 1,000 species of fish and 150 species of coral.]",
    "images": ["rasmohamed1.jpg", "rasmohamed2.jpg", "rasmohamed3.jpg"],
    "ticketPrice": "[PLACEHOLDER: 100 EGP]",
    "openingHours": "[PLACEHOLDER: 8 AM - 5 PM]",
    "heritageStory": "[PLACEHOLDER: Established in 1983, Ras Mohamed was Egypt's first national park. The park protects critical marine ecosystems and serves as a sanctuary for endangered species.]",
    "mapEmbed": "[PLACEHOLDER: Map embed code or image]",
    "nearbyActivities": [
      "[PLACEHOLDER: Snorkeling]",
      "[PLACEHOLDER: Scuba Diving]",
      "[PLACEHOLDER: Glass Bottom Boat Tour]"
    ],
    "reviews": [
      {
        "name": "[PLACEHOLDER: User G]",
        "rating": 5,
        "comment": "[PLACEHOLDER: The underwater world here is absolutely stunning!]"
      }
    ]
  },
  {
    "id": 6,
    "name": "[PLACEHOLDER: Abu Simbel Temples]",
    "category": "Historical",
    "location": "Aswan",
    "description": "[PLACEHOLDER: Massive rock temples built by Ramesses II, a UNESCO World Heritage Site.]",
    "longDescription": "[PLACEHOLDER: The Abu Simbel temples are two massive rock-cut temples in the village of Abu Simbel, Aswan Governorate. They were originally carved out of the mountainside during the reign of Pharaoh Ramesses II in the 13th century BC. The complex was relocated in its entirety in 1968 to avoid being submerged during the creation of Lake Nasser.]",
    "images": ["abusimbel1.jpg", "abusimbel2.jpg", "abusimbel3.jpg"],
    "ticketPrice": "[PLACEHOLDER: 350 EGP]",
    "openingHours": "[PLACEHOLDER: 5 AM - 6 PM]",
    "heritageStory": "[PLACEHOLDER: The temples were built as a lasting monument to King Ramesses II and his wife Nefertari. The relocation of the temples in the 1960s was one of the greatest challenges of archaeological engineering ever performed.]",
    "mapEmbed": "[PLACEHOLDER: Map embed code or image]",
    "nearbyActivities": [
      "[PLACEHOLDER: Sunrise Tour]",
      "[PLACEHOLDER: Lake Nasser Cruise]",
      "[PLACEHOLDER: Nubian Village Visit]"
    ],
    "reviews": [
      {
        "name": "[PLACEHOLDER: User H]",
        "rating": 5,
        "comment": "[PLACEHOLDER: The sunrise here is magical! Worth the early wake-up.]"
      }
    ]
  },
  {
    "id": 7,
    "name": "[PLACEHOLDER: Alexandria Library]",
    "category": "Cultural",
    "location": "Alexandria",
    "description": "[PLACEHOLDER: Modern library commemorating the ancient Library of Alexandria, a center of knowledge and learning.]",
    "longDescription": "[PLACEHOLDER: The Bibliotheca Alexandrina is a major library and cultural center located on the shore of the Mediterranean Sea. It is both a commemoration of the Library of Alexandria that was lost in antiquity, and an attempt to rekindle something of the brilliance that this earlier center of learning and scholarship represented.]",
    "images": ["library1.jpg", "library2.jpg", "library3.jpg"],
    "ticketPrice": "[PLACEHOLDER: 70 EGP]",
    "openingHours": "[PLACEHOLDER: 10 AM - 7 PM]",
    "heritageStory": "[PLACEHOLDER: The original Library of Alexandria was one of the largest and most significant libraries of the ancient world. The new library, opened in 2002, honors this legacy while serving as a modern center of culture and learning.]",
    "mapEmbed": "[PLACEHOLDER: Map embed code or image]",
    "nearbyActivities": [
      "[PLACEHOLDER: Visit Qaitbay Citadel]",
      "[PLACEHOLDER: Walk the Corniche]",
      "[PLACEHOLDER: Explore Catacombs of Kom El Shoqafa]"
    ],
    "reviews": [
      {
        "name": "[PLACEHOLDER: User I]",
        "rating": 4.5,
        "comment": "[PLACEHOLDER: Beautiful architecture and impressive collection!]"
      }
    ]
  },
  {
    "id": 8,
    "name": "[PLACEHOLDER: Hurghada Beach Resort]",
    "category": "Entertainment",
    "location": "Hurghada",
    "description": "[PLACEHOLDER: Popular Red Sea resort destination with beautiful beaches and water sports.]",
    "longDescription": "[PLACEHOLDER: Hurghada is a beach resort town stretching along Egypt's Red Sea coast. It's known for its scuba diving and snorkeling opportunities, with numerous dive sites and coral reefs. The town offers a range of beach activities, nightlife, and desert excursions.]",
    "images": ["hurghada1.jpg", "hurghada2.jpg", "hurghada3.jpg"],
    "ticketPrice": "[PLACEHOLDER: Varies by resort]",
    "openingHours": "[PLACEHOLDER: 24/7]",
    "heritageStory": "[PLACEHOLDER: Once a small fishing village, Hurghada has transformed into one of Egypt's most popular tourist destinations, attracting visitors from around the world with its year-round sunshine and beautiful Red Sea waters.]",
    "mapEmbed": "[PLACEHOLDER: Map embed code or image]",
    "nearbyActivities": [
      "[PLACEHOLDER: Snorkeling Trip]",
      "[PLACEHOLDER: Desert Safari]",
      "[PLACEHOLDER: Giftun Island Tour]"
    ],
    "reviews": [
      {
        "name": "[PLACEHOLDER: User J]",
        "rating": 4,
        "comment": "[PLACEHOLDER: Perfect for a relaxing beach vacation!]"
      }
    ]
  }
]
